module.exports = 
{
    // Конфигурация сервера
    PORT: process.env.PORT || 3000,
    
    // Конфигурация API
    STORE_ID: 1,              // 1 = Steam
    MAX_PAGES: 10,            // Максимальное количество страниц для извлечения
    PAGE_SIZE: 20,            // Количество игр на странице для разбивки на страницы
    
    // Конфигурация Кэша
    CACHE_DURATION: 10 * 60 * 1000, 
    
    // API таймаут
    API_TIMEOUT: 10000,       
    
    // Ограничение скорости
    RATE_LIMIT_WAIT: 5000,    
};